# GetOverrideTransparency Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DrawContext..::..GetOverrideTransparency Method
DrawContext Class See Also
---
Returns override transparency that will be applied to geometry during rendering.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static bool GetOverrideTransparency(
	out double transparency
)
```

Visual Basic
---
```text
Public Shared Function GetOverrideTransparency ( _
	<OutAttribute> ByRef transparency As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool GetOverrideTransparency(
	[OutAttribute] double% transparency
)
```

# ### Parameters
transparency
    Type: System..::..Double%
# See Also
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace